/*
4b.
Дадено се множество от N цели положителни  числа. Да се напише програма, която да намира медианата на множеството. Медиана е средния елемент в нареденото множество. 

Вход:
Най-напред на входа се задава броя на примерите. За всеки пример на отделен ред е даден броя N на елементите на множеството (N < 1011). Следват самите елементи, които са числа, по-малки от 1020.

Изход:
За всеки пример на изхода на отделен ред се отпечатва отговора. Ако има два средни елементи, да се отпечати по-малкия.

Пример:
2
5 
12 4 22 31 32
8
22 33 44 11 55 66 88 99 

Решение на примера:
22
44
*/
#include <iostream>
#include<algorithm>
using namespace std;
int main()
{
	int cycle;
	cin >> cycle;
	for (size_t i = 0; i < cycle; i++)
	{
		int n;
		cin >> n;
		long long unsigned int* arr = new long long unsigned int[n];
		for (size_t i = 0; i < n; i++)
		{
			cin >> arr[i];
		}
		sort(arr, arr+n);
		(n % 2 == 0 ? cout << arr[((n - 1) / 2)] << endl : cout << arr[n / 2] << endl);
		delete arr;
	}
	return 0;
}